	IDENTIFICATION DIVISION.
	PROGRAM-ID. DAY2.

	ENVIRONMENT DIVISION.

	DATA DIVISION.
	WORKING-STORAGE SECTION.
	01 TABLE-LINE PIC X(256).
	01 TABLE-COLUMNS.
	   10 TABLE-COLUMN OCCURS 16 TIMES PIC 9(4).
	01 WORK-VALUES.
	   10 CHECKSUM PIC 9(9).
	   10 MINVAL PIC 9(4).
	   10 MAXVAL PIC 9(4).
	   10 DIFFVAL PIC 9(4).
	   10 COUNT-1 PIC 99.
	   10 COUNT-2 PIC 99.
	   10 COMP-VAL-1 PIC 9(4).
	   10 COMP-VAL-2 PIC 9(4).
	   10 RESULT PIC 9(4).
	   10 REMAIN PIC 9(4).
	   10 SUMRESULTS PIC 9(9).

	PROCEDURE DIVISION.
  MAIN.
    MOVE 0 TO CHECKSUM.
    MOVE 0 TO SUMRESULTS.
    PERFORM 16 TIMES
      PERFORM READ-LINE
      PERFORM DAY1-PROCESS
      PERFORM DAY2-PROCESS
    END-PERFORM.
    DISPLAY "Checksum = " CHECKSUM.
    DISPLAY "Sum Results = " SUMRESULTS.
		STOP RUN.
  
  READ-LINE.
    ACCEPT TABLE-LINE
    MOVE SPACE TO TABLE-COLUMNS
    UNSTRING TABLE-LINE
      DELIMITED BY X"09"
      INTO TABLE-COLUMN(1)
        TABLE-COLUMN(2)
        TABLE-COLUMN(3)
        TABLE-COLUMN(4)
        TABLE-COLUMN(5)
        TABLE-COLUMN(6)
        TABLE-COLUMN(7)
        TABLE-COLUMN(8)
        TABLE-COLUMN(9)
        TABLE-COLUMN(10)
        TABLE-COLUMN(11)
        TABLE-COLUMN(12)
        TABLE-COLUMN(13)
        TABLE-COLUMN(14)
        TABLE-COLUMN(15)
        TABLE-COLUMN(16)
    ON OVERFLOW
       DISPLAY "ERROR"
    END-UNSTRING.

  DAY1-PROCESS.
    PERFORM GET-MAX
    PERFORM GET-MIN
    MOVE MAXVAL TO DIFFVAL
    SUBTRACT MINVAL FROM DIFFVAL
    ADD DIFFVAL TO CHECKSUM.

  DAY2-PROCESS.
    MOVE 1 TO COUNT-1.
    MOVE 2 TO COUNT-2.
    PERFORM UNTIL COUNT-1 = 17
      PERFORM DAY2-SUB
    END-PERFORM.

  DAY2-SUB.
    MOVE TABLE-COLUMN(COUNT-1) TO COMP-VAL-1.
    MOVE TABLE-COLUMN(COUNT-2) TO COMP-VAL-2.
    PERFORM DAY2-CHECK.
    ADD 1 TO COUNT-2.
    IF COUNT-2 = COUNT-1 THEN
      ADD 1 TO COUNT-2
    END-IF.
    IF COUNT-2 = 17 THEN
      ADD 1 TO COUNT-1
      MOVE 1 TO COUNT-2
    END-IF.

  DAY2-CHECK.
    DIVIDE COMP-VAL-1 BY COMP-VAL-2
      GIVING RESULT REMAINDER REMAIN.
    IF REMAIN = 0 THEN
      ADD RESULT TO SUMRESULTS
    END-IF.

  GET-MAX.
    MOVE FUNCTION MAX(TABLE-COLUMN(1),
        TABLE-COLUMN(2),
        TABLE-COLUMN(3),
        TABLE-COLUMN(4),
        TABLE-COLUMN(5),
        TABLE-COLUMN(6),
        TABLE-COLUMN(7),
        TABLE-COLUMN(8),
        TABLE-COLUMN(9),
        TABLE-COLUMN(10),
        TABLE-COLUMN(11),
        TABLE-COLUMN(12),
        TABLE-COLUMN(13),
        TABLE-COLUMN(14),
        TABLE-COLUMN(15),
        TABLE-COLUMN(16)) TO MAXVAL.

  GET-MIN.
    MOVE FUNCTION MIN(TABLE-COLUMN(1),
        TABLE-COLUMN(2),
        TABLE-COLUMN(3),
        TABLE-COLUMN(4),
        TABLE-COLUMN(5),
        TABLE-COLUMN(6),
        TABLE-COLUMN(7),
        TABLE-COLUMN(8),
        TABLE-COLUMN(9),
        TABLE-COLUMN(10),
        TABLE-COLUMN(11),
        TABLE-COLUMN(12),
        TABLE-COLUMN(13),
        TABLE-COLUMN(14),
        TABLE-COLUMN(15),
        TABLE-COLUMN(16)) TO MINVAL.
